EDT/УТ/src/Catalogs/МетодыAPI/МетодыAPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МетодыAPI</name>
  <predefined>
    <items>
      <name>PPFM_getModifiedOrders</name>
      <description>(PPFM) Get modified orders</description>
    </items>
    <items>
      <name>ArticleInfoGet</name>
      <description>ArticleInfoGet</description>
    </items>
    <items>
      <name>ArticleReturnedSend</name>
      <description>ArticleReturnedSend</description>
    </items>
    <items>
      <name>cancelOrder</name>
      <description>Cancel order</description>
    </items>
    <items>
      <name>CarriageContentGet</name>
      <description>CarriageContentGet</description>
    </items>
    <items>
      <name>CarriageListGet</name>
      <description>CarriageListGet</description>
    </items>
    <items>
      <name>CarriageReceive</name>
      <description>CarriageReceive</description>
    </items>
    <items>
      <name>CreateMap</name>
      <description>CreateMap</description>
    </items>
    <items>
      <name>DeleteFile</name>
      <description>DeleteFile</description>
    </items>
    <items>
      <name>delRegistrationChecks</name>
      <description>delRegistrationChecks</description>
    </items>
    <items>
      <name>delRegistrationShiftDocs</name>
      <description>delRegistrationShiftDocs</description>
    </items>
    <items>
      <name>FinalizationPendingChanges</name>
      <description>FinalizationPendingChanges</description>
    </items>
    <items>
      <name>getCustomerLink</name>
      <description>Get customer link</description>
    </items>
    <items>
      <name>GetModifiedOrders</name>
      <description>Get modified orders</description>
    </items>
    <items>
      <name>GetActiveMapVersion</name>
      <description>GetActiveMapVersion</description>
    </items>
    <items>
      <name>getChecks</name>
      <description>getChecks</description>
    </items>
    <items>
      <name>GetDeliveryCostCalculationTariffs</name>
      <description>GetDeliveryCostCalculationTariffs</description>
    </items>
    <items>
      <name>GetDistance</name>
      <description>GetDistance</description>
    </items>
    <items>
      <name>GetMap</name>
      <description>GetMap</description>
    </items>
    <items>
      <name>GetMapVersions</name>
      <description>GetMapVersions</description>
    </items>
    <items>
      <name>getOrderInfo</name>
      <description>getOrderInfo</description>
    </items>
    <items>
      <name>GetOrdersTariffComponents</name>
      <description>GetOrdersTariffComponents</description>
    </items>
    <items>
      <name>GetPolygonsForOrders</name>
      <description>GetPolygonsForOrders</description>
    </items>
    <items>
      <name>getResultTaskYandexRouting</name>
      <description>getResultTaskYandexRouting</description>
    </items>
    <items>
      <name>getShiftDocs</name>
      <description>getShiftDocs</description>
    </items>
    <items>
      <name>loadCashboxes</name>
      <description>loadCashboxes</description>
    </items>
    <items>
      <name>loadCashiers</name>
      <description>loadCashiers</description>
    </items>
    <items>
      <name>loadGoods</name>
      <description>loadGoods</description>
    </items>
    <items>
      <name>loadGoodsSellers</name>
      <description>loadGoodsSellers</description>
    </items>
    <items>
      <name>loadOrganizations</name>
      <description>loadOrganizations</description>
    </items>
    <items>
      <name>PlaceInfoListGet</name>
      <description>PlaceInfoListGet</description>
    </items>
    <items>
      <name>PostingDeliveryDateChange</name>
      <description>PostingDeliveryDateChange</description>
    </items>
    <items>
      <name>PostingGiveout</name>
      <description>PostingGiveout</description>
    </items>
    <items>
      <name>PostingGiveoutToCourier</name>
      <description>PostingGiveoutToCourier</description>
    </items>
    <items>
      <name>PostingReceive</name>
      <description>PostingReceive</description>
    </items>
    <items>
      <name>PostingReturn</name>
      <description>PostingReturn</description>
    </items>
    <items>
      <name>putTaskYandexRouting</name>
      <description>putTaskYandexRouting</description>
    </items>
    <items>
      <name>RegisterOrderExtended</name>
      <description>RegisterOrderExtended</description>
    </items>
    <items>
      <name>ReportGet</name>
      <description>ReportGet</description>
    </items>
    <items>
      <name>ReturnBoxCreate</name>
      <description>ReturnBoxCreate</description>
    </items>
    <items>
      <name>ReturnReasonListGet</name>
      <description>ReturnReasonListGet</description>
    </items>
    <items>
      <name>SaveFile</name>
      <description>SaveFile</description>
    </items>
    <items>
      <name>send</name>
      <description>send</description>
    </items>
    <items>
      <name>setOrdersState</name>
      <description>Set orders state</description>
    </items>
    <items>
      <name>setOrdersZone</name>
      <description>Set orders zone</description>
    </items>
    <items>
      <name>setStatus</name>
      <description>Set status</description>
    </items>
    <items>
      <name>SetTrip</name>
      <description>Set trip</description>
    </items>
    <items>
      <name>SetAcceptedPlaces</name>
      <description>SetAcceptedPlaces</description>
    </items>
    <items>
      <name>SetActiveMapVersion</name>
      <description>SetActiveMapVersion</description>
    </items>
    <items>
      <name>SetExcludedBarcodes</name>
      <description>SetExcludedBarcodes</description>
    </items>
    <items>
      <name>SetOrderCars</name>
      <description>SetOrderCars</description>
    </items>
    <items>
      <name>SetOrderLocationFlag</name>
      <description>SetOrderLocationFlag</description>
    </items>
    <items>
      <name>SetOrdersDeliveryDate</name>
      <description>SetOrdersDeliveryDate</description>
    </items>
    <items>
      <name>SetOrdersFinalStatus</name>
      <description>SetOrdersFinalStatus</description>
    </items>
    <items>
      <name>SetOrdersStatus</name>
      <description>SetOrdersStatus</description>
    </items>
    <items>
      <name>SetOrdersTariffComponents</name>
      <description>SetOrdersTariffComponents</description>
    </items>
    <items>
      <name>SetPendingChanges</name>
      <description>SetPendingChanges</description>
    </items>
    <items>
      <name>SetRefusedOrderItems</name>
      <description>SetRefusedOrderItems</description>
    </items>
    <items>
      <name>SetServiceDc</name>
      <description>SetServiceDc</description>
    </items>
    <items>
      <name>SVRP</name>
      <description>SVRP</description>
    </items>
    <items>
      <name>unloadBarcodes</name>
      <description>Unload barcodes</description>
    </items>
    <items>
      <name>unregistrateOrders</name>
      <description>Unregistrate orders</description>
    </items>
    <items>
      <name>UpdateOrderExtended</name>
      <description>UpdateOrderExtended</description>
    </items>
    <items>
      <name>UpdateReasonsDirectory</name>
      <description>UpdateReasonsDirectory</description>
    </items>
    <items>
      <name>uploadReceipts</name>
      <description>Upload receipts</description>
    </items>
  </predefined>
  <attributes>
    <name>API</name>
    <type>
      <types>CatalogRef.API</types>
    </type>
  </attributes>
  <attributes>
    <name>СжатиеЗапроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СжатиеОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/HTTPServices/PPFM/Module.bsl
Функция ppFmExchangePOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Попытка
		Если ИмяМетода = "getOrderInfo" Тогда
			ВходныеДанные = РаботаСПВЗФМСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСПВЗФМСервер.ПолучитьИнформациюОЗаказе(ВходныеДанные);
			СтрокаJSON = РаботаСПВЗФМСервер.СформироватьСтрокуJSON(ОтветМетода);
			
			//логирование
			ПараметрыЛога = ВнешнееЛогированиеСервер.ПараметрыЗаписиЛогаСервиса(Справочники.API.PPFM, Справочники.МетодыAPI.getOrderInfo);
			ПараметрыЛога.requestXML = ТекстЗапроса;
			ПараметрыЛога.responseXML = СтрокаJSON;
			
			Попытка
				ПараметрыЛога.isError = ОтветМетода.result.isDone <> Истина;
			Исключение
				ПараметрыЛога.isError = Истина;
			КонецПопытки;
			
			ВнешнееЛогированиеСервер.ЗаписатьСтрокуЛогаСервиса(ПараметрыЛога);
		ИначеЕсли ИмяМетода = "setStatus" Тогда
			ВходныеДанные = РаботаСПВЗФМСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСПВЗФМСервер.УстановитьСтатусЗаказа(ВходныеДанные);
			СтрокаJSON = РаботаСПВЗФМСервер.СформироватьСтрокуJSON(ОтветМетода);
			
			//логирование
			ПараметрыЛога = ВнешнееЛогированиеСервер.ПараметрыЗаписиЛогаСервиса(Справочники.API.PPFM, Справочники.МетодыAPI.setStatus);
			ПараметрыЛога.requestXML = ТекстЗапроса;
			ПараметрыЛога.responseXML = СтрокаJSON;
			
			Попытка
				ПараметрыЛога.isError = ОтветМетода.result.isDone <> Истина;
			Исключение
				ПараметрыЛога.isError = Истина;
			КонецПопытки;
			
			ВнешнееЛогированиеСервер.ЗаписатьСтрокуЛогаСервиса(ПараметрыЛога);
		ИначеЕсли ИмяМетода = "getModifiedOrders" Тогда
			ВходныеДанные = РаботаСПВЗФМСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСПВЗФМСервер.ПолучитьИзмененныеЗаказы(ВходныеДанные);
			СтрокаJSON = РаботаСПВЗФМСервер.СформироватьСтрокуJSON(ОтветМетода);
			
			//логирование
			ПараметрыЛога = ВнешнееЛогированиеСервер.ПараметрыЗаписиЛогаСервиса(Справочники.API.PPFM, Справочники.МетодыAPI.GetModifiedOrders);
			ПараметрыЛога.requestXML = ТекстЗапроса;
			ПараметрыЛога.responseXML = СтрокаJSON;
			
			Попытка
				ПараметрыЛога.isError = ОтветМетода.result.isDone <> Истина;
			Исключение
				ПараметрыЛога.isError = Истина;
			КонецПопытки;
			
			ВнешнееЛогированиеСервер.ЗаписатьСтрокуЛогаСервиса(ПараметрыЛога);
		ИначеЕсли ИмяМетода = "unregistrateOrders" Тогда
			ВходныеДанные = РаботаСПВЗФМСервер.ДанныеJSONВСтруктуру(ТекстЗапроса);
			ОтветМетода = РаботаСПВЗФМСервер.УдалитьРегистрациюЗаказов(ВходныеДанные);
			СтрокаJSON = РаботаСПВЗФМСервер.СформироватьСтрокуJSON(ОтветМетода);
			
			//логирование
			ПараметрыЛога = ВнешнееЛогированиеСервер.ПараметрыЗаписиЛогаСервиса(Справочники.API.PPFM, Справочники.МетодыAPI.unregistrateOrders);
			ПараметрыЛога.requestXML = ТекстЗапроса;
			ПараметрыЛога.responseXML = СтрокаJSON;
			
			Попытка
				ПараметрыЛога.isError = ОтветМетода.result.isDone <> Истина;
			Исключение
				ПараметрыЛога.isError = Истина;
			КонецПопытки;
			
			ВнешнееЛогированиеСервер.ЗаписатьСтрокуЛогаСервиса(ПараметрыЛога);
		КонецЕсли;
		
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Исключение
		СписокПолучателей = Новый Массив;
		//СписокПолучателей.Добавить("n.stepanov@strizh-logistic.ru");
		СписокПолучателей.Добавить("evgeniy.marochkin@strizh-logistic.ru");
		
		lem.ОтправитьСообщение(СписокПолучателей, "Ошибка при вызове метода ppFmExchange_" + ИмяМетода, ОписаниеОшибки() , , "Логистическая компания ""Стриж""");
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции
